import './App.css';
 import Book from './components/book.jsx';
import img from './images/saotsrebatha-qveqhana-da-samqharos-dasasruli.new_.webp';

function App() {
  const characters = [
     "მთავარი გმირი",
    "გოგონა გრძელი თმით",
    "მეცნიერი",
    "ბიბლიოთეკარი",
    "მხეცების მწყემსი"
  ];
  const showinfo = (title, characters) => {
  if (Array.isArray(characters)) {
    console.log("Title: " + title + "  Characters: " + characters.join(", "));
  } else {
    console.log("Title: " + title + "  Characters: Not an array", characters);
  }
};

  return (
    <div>
      <Book showinfo={showinfo} characters={characters} title="საოცრებათა ქვეყანა და სამყარო" author="ჰარუკი მურაკამი" year="2024" source={img} about="ორი სხვადასხვა სამყაროს ჰარმონიული შეთავსება, თავიდან სრულიად ურთიერთსაწინააღმდეგოდ რომ გეჩვენება, სიუჟეტური ხაზის განვითარებას ეხმარება. ავტორი მშვიდად გვპასუხობს ბუნებრივად გაჩენილ შეკითხვებზე: „ეს რა არის?“ „რატომ?“ „რას გულისხმობს?“ რომელიღაც მომენტში რომანის დასასრული ისეთი სისწრაფით ახლოვდება, რომ სუნთქვა გეკვრის. ფინალი, როგორც ყოველთვის, უამრავ კითხვას ტოვებს, და მხოლოდ ორიოდე მკაფიო პასუხს იძლევა.

ისე, სულ ორი სიტყვითაც შეიძლება ამ რომანის დახასიათება – არარეალურის რეალურობა! იქნებ სწორედ ეს ხიბლავს ჰარუკი მურაკამის მკითხველს!..

1978 წელს 29 წლის ჰარუკი მურაკამი ჯაზის ბარის მფლობელი იყო ტოკიოს ცენტრში. აპრილის ერთ დღეს, ბეისბოლის თამაშის ყურებისას, რომანის დაწერის მუზა ეწვია და მისი ცხოვრებაც შეიცვალა. პირველმა რომანმა, „ყური მიუგდე ქარის სიმღერას“, დებიუტანტი მწერლების კონკურსში გაიმარჯვა და მომდევნო წელს გამოქვეყნდა კიდეც. თუმცა მურაკამის პოპულარობა 1987 წელს „ნორვეგიული ტყის“ გამოცემამ განსაზღვრა. ნაწარმოებმა ის უბრალო მწერლიდან ფენომენად აქცია, მისი ყველა წიგნი ბესტსელერი გახდა და 50-ზე მეტ ენაზე ითარგმნა.

ჰარუკი მურაკამი დღეისათვის ერთ-ერთი ყველაზე
აღიარებული და პოპულარული მწერალია."/>
    </div>
  );
}

export default App;
